#include<stdio.h>

int man()
{
	int i;
	int man[4] = { 0 };			//默认都无犯罪
	for (i = 0; i < 4; i++)
	{
		man[i] = 1;			//假设犯罪
		if ((man[0] != 1) + 
			(man[2] == 1) + 
			(man[3] == 1) + 
			(man[3] != 1) == 3 )		//翻译他们的语言，三个为真即可
		{
			break;
		}
		man[i] = 0;
	}
	putchar('A' + i);
}

int checkData(int* p)			//查重
{
	int tmp[7] = { 0 };		 //标记表，实际是哈希表的思路。一开始每个元素都是0。
	int i = 0;
	for (i = 0; i < 5; i++)
	{
		if (tmp[p[i]])
		{
			return 0;			//当前位置已经被标记为1，则回复0；不是正确答案
		}
		tmp[p[i]] = 1;			//第一次出现的标记为1；
	}
	return 1;				//全部标记完毕也没有出现重复的情况
}

void diving()
{
	int p[5];
	for (p[0] = 1; p[0] <= 5; p[0]++)			//遍历每一种可能，直接对当前数字进行++，当前数组存储当前位次，然后判断
	{
		for (p[1] = 1; p[1] <= 5; p[1]++)		//从一开始，所以可以等于0
		{
			for (p[2] = 1; p[2] <= 5; p[2]++)
			{
				for (p[3] = 1; p[3] <= 5; p[3]++)
				{
					for (p[4] = 1; p[4] <= 5; p[4]++)
					{
						if ((p[1] == 2) + (p[0] == 3) == 1 &&
							(p[1] == 2) + (p[4] == 4) == 1 &&
							(p[2] == 1) + (p[3] == 2) == 1 &&
							(p[2] == 5) + (p[3] == 3) == 1 &&
							(p[0] == 1) + (p[4] == 4) == 1 &&
							checkData(p)				//查重，不存在并列
							)
						{
							for (int i = 0; i < 5; i++)
							{
								printf("%d ", p[i]);
							}
							putchar('\n');
						}
					}
				}	
			}		
		}		
	}	
}

int main()
{
	diving();
	man();
}